Revit 2024 API
RebarContainerItem.ArrayLength Property
 Identifies the distribution path length of rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double ArrayLength { get; set; }
Visual Basic
Public Property ArrayLength As Double
	Get
	Set
Visual C++
public:
property double ArrayLength {
	double get ();
	void set (double value);
}
Field Value
 The distribution path length of rebar set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the set length arrayLength isn't acceptable.
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace